# http://solvespace.com/
# 為何使用 Solvespace? 自由開源的 Solvespace
# 請問您離開學校時, 能隨身攜帶一套 Creo Parametric, Solidworks 或 AutoDesk Inventor 離開嗎?
# Solvespace 有那些功能?
'''
Solvespace 是一套輕薄短小的電腦輔助 3D 機械參數繪圖套件, 支援簡單外型零件的繪製與組立, 從 2013 年 7 月之後已經採 GPL 模式釋出, 各方用戶可以免費使用.

Solvespace 之所以轉為 GPL 並免費釋出原始碼的動機, 相信是在昭告全球面對 3D 印表機普及化時代的到來, 爾後任何人只要利用 Solvespace 就可以設計出所需的簡單機構零組件, 然後以平價 3D 印表機直接列印零件後進行組裝測試, 一旦產品的設計概念可行, 即可轉為開放產品與他人共享, 或進一步轉為批量較大的商用產品設計與開發流程.

Solvespace 目前除了可在 Windows 10 環境中使用外, 也能在 Linux 中的 Wine 環境中使用.

儘管 Solvespace 目前所支援的實體成形功能只有直線與旋轉長出, 而且僅支援零件與斷面資料轉出而無法轉入零件, 但是就一般簡單採用雷射切割與 3D 列印開發初步產品雛形的需求已經足夠.

Solvespace 所提供的功能:
 
建立 3D 零件檔案 - 直線長出與旋轉長出, 以及布林運算(聯集或交集)
 
建立 2D 零件檔案 - 畫出零件斷面輪廓, 然後以 DXF, PDF, SVG 等格式輸出後, 轉進其他套件後使用.
 
3D 列印用檔案 - 以 STL 格式轉出, 可以直接列印成實體零件.
 
建立 CAM 加工用資料 - 以 2D 格式轉出後, 可以利用水刀或雷射切割機進行切割, 或者將 3D 零件檔案以 STEP 或 STL 格式轉出後, 再轉入其他 CAM 套件中進行刀具路徑模擬或製造規劃.
 
機構設計 - 靈活運用約束條件來模擬配置轉動接頭, 球接頭或滑動接頭的平面或空間機構.
 
平面與實體幾何應用 - 將原先以手算或試算表運算中的幾何約束題目改採互動式尺寸繪圖求解.
由於 Solvespace 提供簡便的參數約束繪圖功能, 讓以平面設計為主的機構路徑通過點分析得以有效進行, 配合其提供的 C++ 原始, 使用者可以據以進一步了解計算機圖學中約束條件解題與 OpenGL 零件動態展示的各種應用.

快速導引: 啟動 Solvespace 後, 畫面中會有一個空白的工作平面.
 
畫直線, 選擇 Sketch → Line Segment (or circle, or arc, or ...) 指令. 接著以滑鼠左鍵定義直線各端點. 按下 Escape 就可以跳出畫直線的功能, 若是要建立頭尾相連的封閉線段, 則最後以滑鼠左鍵點選現有的點, 可以完成封閉線段繪製.
 
按住滑鼠右鍵後移動, 可以平移畫面, 按住滑鼠中鍵後移動, 可以旋轉畫面, 捲動滑鼠中鍵滾輪則可以放大縮小畫面, 當畫面移動後需要讓視圖與工作平面對齊, 選擇 View -> Align View to Workplane (或按 w).
 
選擇某一直線, 直接以滑鼠劃過該直線後 (直線轉為黃色), 接著以滑鼠左鍵點選該直線(直線轉為紅色), 之後要以尺寸標示來約束該直線長度, 則在該直線被選取轉為紅色後, 再選擇 Constrain -> Distance/Diameter, 或者直接按下快捷鍵 d 來尺寸約束該直線.
 
尺寸標示後, 若要移動該尺寸標示位置, 則利用滑鼠選擇後即可移到新的位置後即可, 若要更改尺寸 ,則雙點擊後輸出新尺寸, 然後按下 Enter 即可完成.
 
倒圓角, 選擇兩直線的交點後, 選擇 Sketch -> Tangent Arc at Point.
 
繪圖過程視窗又稱為 Text Window, 可以利用 Tab 按鍵關閉或開啟 Text Window, 下拉式功能表則位於 View -> Show Text Window
 
在新工作面上作圖 - 建立新工作平面的做法之一為:
 
1. 選擇一個點
 
2. 選擇 New Group -> Sketch in New Workplane
 
    這個指令為以第 1 步所選的點作為原點, 作一個平行 XY 平面的工作面(會自動選擇鄰近, 且最貼近目前所在視圖面的既有工作平面).
3. 建立新工作面後, Solvespace 會自動將工作平面與視圖對齊, 若沒有對齊, 也可以選擇 View - > Align View to Workplane(或按 w), 強制其對齊.
 
在新工作面上作圖 - 建立新工作平面的做法之二為:
 
1. 選擇一個點.
 
2. 再選擇交於此點的兩條直線.
 
3. 選擇 New Group -> Sketch in New Workplane
'''
'''
彎角支架零件繪圖

在此教學導引中, 將繪製上列彎角支架零件. 此零件內部有一倒角與支撐片. 彎角兩邊與支撐片同厚度. 兩個等直徑的套孔位於支架一端, 以支撐片為中心對稱.

啟動 SolveSpace 後, 將自動新增一空白零件檔案, 視圖將與 XY 平面對齊; 平面標示位於畫面左下方, 以暗灰色 #XY 表示. 坐標軸也位於左下方, 分別以紅綠藍色表示 X, Y 與 Z 軸.

當以滑鼠橫過任何元件, 約束條件或繪圖物件時, 該物件會以黃色高亮度顯示. 例如, 原先以虛線表示的正方形 XY 平面, 以滑鼠橫過時將會以高亮黃色顯示. 而 YZ 與 ZX 平面, 因為是從邊上檢視, 因此以虛線表示, 若以滑鼠經過仍會轉為高亮顯示. X, Y, Z 軸也是如此(以箭頭表示), 還有原點以綠色正形點表示.

要旋轉零件視圖, 只要按下並移動滑鼠中鍵(或滾輪). 要平移則按下並移動滑鼠右鍵. 要縮放, 則使用滑鼠滾輪獲選擇 View -> Zoom In or Out.

開啟新檔, 都是先在 XY 平面上繪圖. 以滑鼠中鍵點按並移動後將可旋轉視圖, 之後也可試著將視圖轉回與 XY 平面對齊, 但幾乎很難作到. 為了要回到 XY 平面的視圖, (也就是視圖平行 XY 平面, 且以原點為中心), 可以選擇 View -> Align View to Workplane 或直接按下 W 鍵, 也可以選擇功能表上的對應指令.(將視圖對齊工作平面的功能表位於最下方的右側, 要知道功能表上各功能的用法, 只要將滑鼠停在該功能表上, 系統就是顯示該工具的說明資料.

首先, 建構彎角的 2D 斷面圖, 接著長出彎角的形體, 之後則利用布林連結建立中間的支撐片, 然後再用布林除料功能挖出所需的套孔.

彎角的斷面以線段構成, 加上一個倒角(內角的倒圓). 先畫直線線段, 選擇 Sketch -> 線段, 或者從工具箱中選擇指令. 將滑鼠在接近垂直軸的地方畫所需的直線線段, 但是不要直接在垂直軸上選點, 也就是畫線時, 不要讓垂直軸轉為高亮度. (若在繪直線時, 滑鼠選擇點會讓特定元素轉為高亮, 表示相關的約束條件會自動導入, 目前先不要這樣做).

開始畫線, 以滑鼠左鍵選點, 完成畫直線, 則在最後一點再點一次左鍵. 這樣就能完成一條新線段, 也就與舊線段的端點共點, 在繪圖過程 SolveSpace 會警告所繪段面還不是封閉輪廓.

在最後一次以滑鼠左鍵點選之前, 若將滑鼠移到第一條線的起點. 該點就會以黃色高亮顯示. 這時若完成左鍵點選, 則線段會自動靠向直線起點, 並且形成一個封閉輪廓, 這時就可完成畫直線的動作. (也可以按下 Esc 鍵或按下滑鼠右鍵來完成畫直線). 在此要畫一個封閉的輪廓.
'''
# Solvespace 或 OnShape 繪製零組件, 然後利用 V-rep 進行多連桿機構的運動分析: https://vimeo.com/175117655
# 也可以在 Vimeo 用 Solvespace 關鍵字查詢, 找出先前的操作示範影片
